## Target Guided Ordinal Encoding 

Target Guided Ordinal Encoding is a categorical encoding technique used in machine learning preprocessing. It is especially useful for encoding categorical variables based on their relationship with the target variable, usually in a supervised learning problem like regression or classification.
___
**üîç What is it?** <br>
Target Guided Ordinal Encoding replaces each category in a categorical variable with a number that reflects the mean of the target variable for that category.
___
**‚úÖ Why use it?** <br>
This encoding captures the relationship between the categorical feature and the target variable, which can improve the model‚Äôs predictive power‚Äîespecially for tree-based models like XGBoost or LightGBM.

In [14]:
## create a dataFrame
import pandas as pd
df = pd.DataFrame({
    'city': ['New York', 'London', 'Paris', 'Tokyo', 'New York', 'Paris'],
    'price': [200, 150, 300, 250, 180, 320]
})

In [15]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [16]:
mean_price = df.groupby('city')['price'].mean().to_dict()  ## city ko group kiya based on price aur price ka mean nikal ke ise dictionary me change kr diya

In [17]:
mean_price

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [18]:
df['city_encoded'] = df['city'].map(mean_price)

In [19]:
df

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         310.0